app/Controllers/Auth.php

    public function doRegister(): \CodeIgniter\HTTP\RedirectResponse
    {
        $rules = [
            'name'     => 'required|min_length[2]|max_length[100]',
            'email'    => 'required|valid_email|is_unique[users.email]',
            'password' => 'required|min_length[6]',
            'password_confirm' => 'required|matches[password]',
        ];

        $messages = [
            'email'    => ['is_unique' => 'Email sudah digunakan.'],
            'password_confirm' => ['matches' => 'Konfirmasi password tidak cocok.'],
        ];

        if (! $this->validate($rules, $messages)) {
            return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
        }

        $userId = $this->userModel->insert([
            'name'     => $this->request->getPost('name'),
            'email'    => $this->request->getPost('email'),
            'password' => $this->request->getPost('password'),
        ]);
---
INSERT INTO `users` (`name`, `email`, `password`, `created_at`, `updated_at`) VALUES ('Calvin Samuel Simbolon', 'calvins.simbolon@gmail.com', '$2y$12$1fQBKwej9RiugQdQVKqmiOWuIF9xY1lqtA4606XdDjqhhZBKT8YX6', '2026-08-25 14:19:30', '2026-08-25 14:19:30')