app/Controllers/Dashboard.php

    public function index(): string
    {
        $userId = session()->get('user_id');

        $data = [
            'title'           => 'Dashboard',
            'sidebar_tree'    => $this->spaceModel->getSidebarTree($userId),
            'pending_tickets' => $this->ticketModel->getTodayPendingCount($userId),
            'sessions_today'  => $this->sessionModel->getTodaySessionCount($userId),
            'recent_sessions' => $this->sessionModel->getRecentSessions($userId, 5),
            'active_session'  => $this->sessionModel->getActiveSession($userId),
            'spaces_count'    => count($this->spaceModel->where('user_id', $userId)->findAll()),
---
SELECT *
FROM `spaces`
WHERE `user_id` = '1'