app/Controllers/Session.php

SELECT *
FROM `spaces`
WHERE `user_id` = '1'
ORDER BY `name` ASC
---
    public function create(): string
    {
        $userId = session()->get('user_id');
        $spaces = $this->spaceModel->where('user_id', $userId)->orderBy('name', 'ASC')->findAll();