app/Models/ProjectModel.php

SELECT `p`.*, `s`.`name` AS `space_name`, `s`.`id` AS `space_id_check`
FROM `projects` `p`
JOIN `spaces` `s` ON `s`.`id` = `p`.`space_id`
WHERE `p`.`id` = 5
---
    public function getProjectWithSpace(int $projectId): ?array
    {
        return $this->db->table('projects p')
            ->select('p.*, s.name AS space_name, s.id AS space_id_check')
            ->join('spaces s', 's.id = p.space_id')
            ->where('p.id', $projectId)
            ->get()
            ->getRowArray();

SELECT COUNT(*) AS `numrows`
FROM `projects` `p`
JOIN `spaces` `s` ON `s`.`id` = `p`.`space_id`
WHERE `p`.`id` = 5
AND `s`.`user_id` = 1
---
    public function belongsToUser(int $projectId, int $userId): bool
    {
        return $this->db->table('projects p')
            ->join('spaces s', 's.id = p.space_id')
            ->where('p.id', $projectId)
            ->where('s.user_id', $userId)
            ->countAllResults() > 0;