app/Models/SpaceModel.php

    public function getSpacesWithProjectCount(int $userId): array
    {
        return $this->db->table('spaces s')
            ->select('s.*, COUNT(p.id) AS project_count')
            ->join('projects p', 'p.space_id = s.id', 'left')
            ->where('s.user_id', $userId)
            ->groupBy('s.id')
            ->orderBy('s.name', 'ASC')
            ->get()
            ->getResultArray();
---
SELECT `s`.*, COUNT(p.id) AS project_count
FROM `spaces` `s`
LEFT JOIN `projects` `p` ON `p`.`space_id` = `s`.`id`
WHERE `s`.`user_id` = 1
GROUP BY `s`.`id`
ORDER BY `s`.`name` ASC

    public function getSidebarTree(int $userId): array
    {
        $spaces = $this->where('user_id', $userId)->orderBy('name', 'ASC')->findAll();

        foreach ($spaces as &$space) {
            $space['projects'] = $this->db->table('projects')
                ->where('space_id', $space['id'])
                ->orderBy('name', 'ASC')
                ->get()
                ->getResultArray();
---
SELECT *
FROM `spaces`
WHERE `user_id` = 1
ORDER BY `name` ASC
SELECT *
FROM `projects`
WHERE `space_id` = '3'
ORDER BY `name` ASC