app/Models/TicketModel.php

SELECT *
FROM `tickets`
WHERE `project_id` = 5
ORDER BY FIELD(priority, 'urgent-important','important-not-urgent','urgent-not-important','not-urgent-not-important'), `created_at` ASC
---
    public function getTicketsByProject(
        int $projectId,
        ?string $priority = null,
        ?string $status = null
    ): array {
        $builder = $this->where('project_id', $projectId);

        if ($priority && array_key_exists($priority, self::PRIORITIES)) {
            $builder = $builder->where('priority', $priority);
        }

        if ($status && in_array($status, ['pending', 'ongoing', 'done', 'waiting-approval', 'cancelled'])) {
            $builder = $builder->where('status', $status);
        }

        // Order: by priority severity (Q1 first) then by created_at
        $priorityOrder = implode(',', array_map(
            fn($p) => "'" . $p . "'",
            array_keys(self::PRIORITIES)
        ));

        return $builder
            ->orderBy("FIELD(priority, {$priorityOrder})", '', false)
            ->orderBy('created_at', 'ASC')
            ->findAll();

SELECT `status`, COUNT(*) AS count
FROM `tickets`
WHERE `project_id` = 5
GROUP BY `status`
---
    public function getTicketStats(int $projectId): array
    {
        $rows = $this->db->table('tickets')
            ->select('status, COUNT(*) AS count')
            ->where('project_id', $projectId)
            ->groupBy('status')
            ->get()
            ->getResultArray();

SELECT COUNT(*) AS `numrows`
FROM `tickets` `t`
JOIN `projects` `p` ON `p`.`id` = `t`.`project_id`
JOIN `spaces` `s` ON `s`.`id` = `p`.`space_id`
WHERE `s`.`user_id` = 1
AND `t`.`status` IN ('pending','ongoing')
---
    public function getTodayPendingCount(int $userId): int
    {
        return $this->db->table('tickets t')
            ->join('projects p', 'p.id = t.project_id')
            ->join('spaces s', 's.id = p.space_id')
            ->where('s.user_id', $userId)
            ->whereIn('t.status', ['pending', 'ongoing'])
            ->countAllResults();