app/Models/UserModel.php

    public function findByEmail(string $email): ?array
    {
        return $this->where('email', $email)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'calvins.simbolon@gmail.com'
 LIMIT 1